Revit 2024 API
XYZ Constructor
Overload List
Name | Description
XYZ()
Creates a default XYZ with the values (0, 0, 0).
XYZ(Double, Double, Double)
Creates an XYZ with the supplied coordinates.
See Also
XYZ Class
XYZ Members
Autodesk.Revit.DB Namespace